Reports/ИА_ФинансоваяДирективаЛист2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ИА_ФинансоваяДирективаЛист2</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ФинансовоеПланирование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Catalogs/ИА_Фонды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_Фонды</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтображатьВСписке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьРасходВМинус</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Счета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВебУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Защищенный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ИА_ФинансоваяДирективаЛист2/Ext/ObjectModule.bsl
Функция Печать() Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИА_ФинансовоеПланирование_Директива_Лист2";
	
	Запрос = Новый Запрос;
	менеджер = Новый МенеджерВременныхТаблиц;    
	Запрос.МенеджерВременныхТаблиц = менеджер;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФП_Заказы.Фонд КАК Фонд,
	               |	ФП_Заказы.Подразделение КАК Подразделение,
	               |	ФП_Заказы.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	               |	ФП_Заказы.СуммаНал КАК СуммаНал,
	               |	ФП_Заказы.СуммаБезнал КАК СуммаБезнал
	               |ПОМЕСТИТЬ ФП_Заказы
	               |ИЗ
	               |	&ФП_Заказы КАК ФП_Заказы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ФП_СвободныеСредства.Фонд КАК Фонд,
	               |	ФП_СвободныеСредства.Подразделение КАК Подразделение,
	               |	ФП_СвободныеСредства.СуммаНал КАК СуммаНал,
	               |	ФП_СвободныеСредства.СуммаБезнал КАК СуммаБезнал
	               |ПОМЕСТИТЬ ФП_СвободныеСредства
	               |ИЗ
	               |	&ФП_СвободныеСредства КАК ФП_СвободныеСредства
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПолитикаРаспределения.Фонд КАК Фонд,
	               |	ПолитикаРаспределения.Подразделение КАК Подразделение,
	               |	ПолитикаРаспределения.СуммаНал КАК СуммаНал,
	               |	ПолитикаРаспределения.СуммаБезнал КАК СуммаБезнал
	               |ПОМЕСТИТЬ ПолитикаРаспределения
	               |ИЗ
	               |	&ПолитикаРаспределения КАК ПолитикаРаспределения
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПрямыеРасходы.Фонд КАК Фонд,
	               |	ПрямыеРасходы.Подразделение КАК Подразделение,
	               |	ПрямыеРасходы.СуммаНал КАК СуммаНал,
	               |	ПрямыеРасходы.СуммаБезнал КАК СуммаБезнал
	               |ПОМЕСТИТЬ ПрямыеРасходы
	               |ИЗ
	               |	&ПрямыеРасходы КАК ПрямыеРасходы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РаспределениеПоФондам.Фонд КАК НаФонд,
	               |	РаспределениеПоФондам.СФонда КАК СФонда,
	               |	РаспределениеПоФондам.Подразделение КАК НаПодразделение,
	               |	РаспределениеПоФондам.СПодразделения КАК СПодразделения,
	               |	РаспределениеПоФондам.СуммаНал КАК СуммаНал,
	               |	РаспределениеПоФондам.СуммаБезнал КАК СуммаБезнал
	               |ПОМЕСТИТЬ РаспределениеПоФондам
	               |ИЗ
	               |	&РаспределениеПоФондам КАК РаспределениеПоФондам
	               |;
	               |
				   |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДоходыБП.СуммаНал КАК СуммаНал,
				   |	ДоходыБП.СуммаБезнал КАК СуммаБезнал
	               |ПОМЕСТИТЬ ДоходыБП
	               |ИЗ
	               |	&ДоходыБП КАК ДоходыБП
	               |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДоходыБП_Распределение.СуммаНал КАК СуммаНал,
				   |	ДоходыБП_Распределение.СуммаБезнал КАК СуммаБезнал
	               |ПОМЕСТИТЬ ДоходыБП_Распределение
	               |ИЗ
	               |	&ДоходыБП_Распределение КАК ДоходыБП_Распределение
	               |;
				   |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПодЗапрос.Подразделение КАК Подразделение,
	               |	ПодЗапрос.Фонд КАК Фонд,
	               |	ПодЗапрос.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	               |	СУММА(ПодЗапрос.ДоФП_ОстатокНал) КАК ДоФП_ОстатокНал,
	               |	СУММА(ПодЗапрос.ДоФП_ОстатокБезнал) КАК ДоФП_ОстатокБезнал,
				   |	СУММА(ПодЗапрос.ДоФП_ОстатокНал) + СУММА(ПодЗапрос.ДоФП_ОстатокБезнал) КАК ДоФП_Остаток,
	               |	СУММА(ПодЗапрос.ДоФП_РезервНал) КАК ДоФП_РезервНал,
	               |	СУММА(ПодЗапрос.ДоФП_РезервБезнал) КАК ДоФП_РезервБезнал,
				   |	СУММА(ПодЗапрос.ДоФП_РезервНал) + СУММА(ПодЗапрос.ДоФП_РезервБезнал) КАК ДоФП_Резерв,
	               |	СУММА(ПодЗапрос.ФП_РезервНал) КАК ФП_РезервНал,
	               |	СУММА(ПодЗапрос.ФП_РезервБезнал) КАК ФП_РезервБезнал,
				   |	СУММА(ПодЗапрос.ФП_РезервНал) +	СУММА(ПодЗапрос.ФП_РезервБезнал) КАК ФП_Резерв,
	               |	СУММА(ПодЗапрос.ФП_ПриходНал) КАК ФП_ПриходНал,
	               |	СУММА(ПодЗапрос.ФП_ПриходБезнал) КАК ФП_ПриходБезнал,
				   |	СУММА(ПодЗапрос.ФП_ПриходНал) + СУММА(ПодЗапрос.ФП_ПриходБезнал) КАК ФП_Приход,
	               |	СУММА(ПодЗапрос.ДоФП_ОстатокНал) + СУММА(ПодЗапрос.ФП_ПриходНал) - СУММА(ПодЗапрос.ФП_РезервНал) КАК ПослеФП_ОстатокНал,
	               |	СУММА(ПодЗапрос.ДоФП_ОстатокБезнал) + СУММА(ПодЗапрос.ФП_ПриходБезнал) - СУММА(ПодЗапрос.ФП_РезервБезнал) КАК ПослеФП_ОстатокБезнал,
				   |	СУММА(ПодЗапрос.ДоФП_ОстатокНал) + СУММА(ПодЗапрос.ФП_ПриходНал) - СУММА(ПодЗапрос.ФП_РезервНал)   +   СУММА(ПодЗапрос.ДоФП_ОстатокБезнал) + СУММА(ПодЗапрос.ФП_ПриходБезнал) - СУММА(ПодЗапрос.ФП_РезервБезнал) КАК ПослеФП_Остаток,
	               |	СУММА(ПодЗапрос.ДоФП_РезервНал) + СУММА(ПодЗапрос.ФП_РезервНал) КАК ПослеФП_РезервНал,
	               |	СУММА(ПодЗапрос.ДоФП_РезервБезнал) + СУММА(ПодЗапрос.ФП_РезервБезнал) КАК ПослеФП_РезервБезнал,
				   |	СУММА(ПодЗапрос.ДоФП_РезервНал) + СУММА(ПодЗапрос.ФП_РезервНал) + СУММА(ПодЗапрос.ДоФП_РезервБезнал) + СУММА(ПодЗапрос.ФП_РезервБезнал) КАК ПослеФП_Резерв
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ДенежныеСредстваОстатки.БанковскийСчетКасса.Подразделение КАК Подразделение,
	               |		ДенежныеСредстваОстатки.БанковскийСчетКасса.Фонд КАК Фонд,
	               |		&ПустаяСтатья КАК СтатьяДвиженияДенежныхСредств,
	               |		ВЫБОР
	               |			КОГДА ДенежныеСредстваОстатки.БанковскийСчетКасса ССЫЛКА Справочник.Кассы
	               |				ТОГДА ДенежныеСредстваОстатки.СуммаОстаток - ЕСТЬNULL(ДенежныеСредстваВРезервеОстатки.СуммаОстаток, 0)
	               |			ИНАЧЕ 0
	               |		КОНЕЦ КАК ДоФП_ОстатокНал,
	               |		ВЫБОР
	               |			КОГДА ДенежныеСредстваОстатки.БанковскийСчетКасса ССЫЛКА Справочник.БанковскиеСчета
	               |				ТОГДА ДенежныеСредстваОстатки.СуммаОстаток - ЕСТЬNULL(ДенежныеСредстваВРезервеОстатки.СуммаОстаток, 0)
	               |			ИНАЧЕ 0
	               |		КОНЕЦ КАК ДоФП_ОстатокБезнал,
	               |		ВЫБОР
	               |			КОГДА ДенежныеСредстваОстатки.БанковскийСчетКасса ССЫЛКА Справочник.Кассы
	               |				ТОГДА ЕСТЬNULL(ДенежныеСредстваВРезервеОстатки.СуммаОстаток, 0)
	               |			ИНАЧЕ 0
	               |		КОНЕЦ КАК ДоФП_РезервНал,
	               |		ВЫБОР
	               |			КОГДА ДенежныеСредстваОстатки.БанковскийСчетКасса ССЫЛКА Справочник.БанковскиеСчета
	               |				ТОГДА ЕСТЬNULL(ДенежныеСредстваВРезервеОстатки.СуммаОстаток, 0)
	               |			ИНАЧЕ 0
	               |		КОНЕЦ КАК ДоФП_РезервБезнал,
	               |		0 КАК ФП_РезервНал,
	               |		0 КАК ФП_РезервБезнал,
	               |		0 КАК ФП_ПриходНал,
	               |		0 КАК ФП_ПриходБезнал
	               |	ИЗ
	               |		РегистрНакопления.ДенежныеСредства.Остатки(&НаДату, Организация = &Организация) КАК ДенежныеСредстваОстатки
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредстваВРезерве.Остатки(&НаДату, Организация = &Организация) КАК ДенежныеСредстваВРезервеОстатки
	               |			ПО ДенежныеСредстваОстатки.БанковскийСчетКасса = ДенежныеСредстваВРезервеОстатки.БанковскийСчетКасса
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ФП_Заказы.Подразделение,
	               |		ФП_Заказы.Фонд,
	               |		ФП_Заказы.СтатьяДвиженияДенежныхСредств,
	               |		0,
	               |		0,
	               |		0,
	               |		0,
	               |		ФП_Заказы.СуммаНал,
	               |		ФП_Заказы.СуммаБезнал,
	               |		0,
	               |		0
	               |	ИЗ
	               |		ФП_Заказы КАК ФП_Заказы
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПолитикаРаспределения.Подразделение,
	               |		ПолитикаРаспределения.Фонд,
	               |		&ПустаяСтатья,
	               |		0,
	               |		0,
	               |		0,
	               |		0,
	               |		0,
	               |		0,
	               |		ПолитикаРаспределения.СуммаНал,
	               |		ПолитикаРаспределения.СуммаБезнал
	               |	ИЗ
	               |		ПолитикаРаспределения КАК ПолитикаРаспределения
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПрямыеРасходы.Подразделение,
	               |		ПрямыеРасходы.Фонд,
	               |		&ПустаяСтатья,
	               |		0,
	               |		0,
	               |		0,
	               |		0,
	               |		0,
	               |		0,
	               |		ПрямыеРасходы.СуммаНал,
	               |		ПрямыеРасходы.СуммаБезнал
	               |	ИЗ
	               |		ПрямыеРасходы КАК ПрямыеРасходы
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		РаспределениеПоФондам.НаПодразделение,
	               |		РаспределениеПоФондам.НаФонд,
	               |		&ПустаяСтатья,
	               |		0,
	               |		0,
	               |		0,
	               |		0,
	               |		0,
	               |		0,
	               |		РаспределениеПоФондам.СуммаНал,
	               |		РаспределениеПоФондам.СуммаБезнал
	               |	ИЗ
	               |		РаспределениеПоФондам КАК РаспределениеПоФондам
	               |	ГДЕ
	               |		РаспределениеПоФондам.НаФонд <> &ПустойФонд
	               |		И РаспределениеПоФондам.СФонда <> &ПустойФонд
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		РаспределениеПоФондам.СПодразделения,
	               |		РаспределениеПоФондам.СФонда,
	               |		&ПустаяСтатья,
	               |		0,
	               |		0,
	               |		0,
	               |		0,
	               |		0,
	               |		0,
	               |		-РаспределениеПоФондам.СуммаНал,
	               |		-РаспределениеПоФондам.СуммаБезнал
	               |	ИЗ
	               |		РаспределениеПоФондам КАК РаспределениеПоФондам
	               |	ГДЕ
	               |		РаспределениеПоФондам.НаФонд <> &ПустойФонд
	               |		И РаспределениеПоФондам.СФонда <> &ПустойФонд
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ФП_СвободныеСредства.Подразделение,
	               |		ФП_СвободныеСредства.Фонд,
	               |		&ПустаяСтатья,
	               |		0,
	               |		0,
	               |		0,
	               |		0,
	               |		0,
	               |		0,
	               |		ФП_СвободныеСредства.СуммаНал,
	               |		ФП_СвободныеСредства.СуммаБезнал
	               |	ИЗ
	               |		ФП_СвободныеСредства КАК ФП_СвободныеСредства
				   |
				   |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
				   |		&ПодразделениеБП,
	               |		&ФондБП,
				   |		&ПустаяСтатья,
	               |		0,
	               |		0,
	               |		0,
				   |		0,
	               |		0,
	               |		0,
	               |		-ДоходыБП.СуммаНал,
				   |		-ДоходыБП.СуммаБезнал
	               |	ИЗ
	               |		ДоходыБП КАК ДоходыБП
				   |
				   |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
				   |		&ПодразделениеБП,
	               |		&ФондБП,
				   |		&ПустаяСтатья,
	               |		0,
	               |		0,
	               |		0,
				   |		0,
	               |		0,
	               |		0,
	               |		ДоходыБП_Распределение.СуммаНал,
				   |		ДоходыБП_Распределение.СуммаБезнал
	               |	ИЗ
	               |		ДоходыБП_Распределение КАК ДоходыБП_Распределение
				   |) КАК ПодЗапрос
	               |ГДЕ
	               |	ПодЗапрос.Фонд <> &ПустойФонд
	               |	И (ПодЗапрос.ДоФП_ОстатокНал + ПодЗапрос.ДоФП_ОстатокБезнал <> 0
	               |			ИЛИ ПодЗапрос.ДоФП_РезервНал + ПодЗапрос.ДоФП_РезервБезнал <> 0
	               |			ИЛИ ПодЗапрос.ФП_РезервНал + ПодЗапрос.ФП_РезервБезнал <> 0
	               |			ИЛИ ПодЗапрос.ФП_ПриходНал + ПодЗапрос.ФП_ПриходБезнал <> 0)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПодЗапрос.Подразделение,
	               |	ПодЗапрос.Фонд,
	               |	ПодЗапрос.СтатьяДвиженияДенежныхСредств
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПодЗапрос.Подразделение.Наименование,
	               |	ПодЗапрос.Фонд.Код
	               |ИТОГИ
	               |	СУММА(ДоФП_ОстатокНал),
	               |	СУММА(ДоФП_ОстатокБезнал),
	               |	СУММА(ДоФП_РезервНал),
	               |	СУММА(ДоФП_РезервБезнал),
	               |	СУММА(ФП_РезервНал),
	               |	СУММА(ФП_РезервБезнал),
	               |	СУММА(ФП_ПриходНал),
	               |	СУММА(ФП_ПриходБезнал),
	               |	СУММА(ПослеФП_ОстатокНал),
	               |	СУММА(ПослеФП_ОстатокБезнал),
	               |	СУММА(ПослеФП_РезервНал),
	               |	СУММА(ПослеФП_РезервБезнал),
				   |	СУММА(ДоФП_Остаток),
	               |	СУММА(ДоФП_Резерв),
	               |	СУММА(ФП_Резерв),
	               |	СУММА(ФП_Приход),
	               |	СУММА(ПослеФП_Остаток),
	               |	СУММА(ПослеФП_Резерв)
	               |ПО
	               |	ОБЩИЕ,
	               |	Подразделение,
	               |	Фонд,
	               |	СтатьяДвиженияДенежныхСредств";
				   
	ТаблицаЗП = Новый ТаблицаЗначений;
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.ИА_Фонды"));
	ТаблицаЗП.Колонки.Добавить("Фонд", Новый ОписаниеТипов(МассивТипов));
	
	МассивТипов.Очистить();
	МассивТипов.Добавить(Тип("СправочникСсылка.Подразделения"));
	ТаблицаЗП.Колонки.Добавить("Подразделение", Новый ОписаниеТипов(МассивТипов));

	
	МассивТипов.Очистить();
	МассивТипов.Добавить(Тип("СправочникСсылка.СтатьиДвиженияДенежныхСредств"));
	ТаблицаЗП.Колонки.Добавить("СтатьяДвиженияДенежныхСредств", Новый ОписаниеТипов(МассивТипов));
	
	МассивТипов.Очистить();
	МассивТипов.Добавить(Тип("Число"));
	
	ТаблицаЗП.Колонки.Добавить("СуммаНал", Новый ОписаниеТипов(МассивТипов));
	ТаблицаЗП.Колонки.Добавить("СуммаБезнал", Новый ОписаниеТипов(МассивТипов));
	
	Для каждого стр из СсылкаНаОбъект.ЗаказыНаПриобретение Цикл
		Если стр.Статус = Перечисления.СостоянияОбъектов.Утвержден И стр.УтвержденнаяСумма > 0 Тогда
			Новстр = ТаблицаЗП.Добавить();
			Новстр.Фонд = стр.Заказ.БанковскийСчетКасса.Фонд;
			Новстр.Подразделение = стр.Заказ.БанковскийСчетКасса.Подразделение;
			Если ТипЗнч(стр.Заказ.БанковскийСчетКасса)=Тип("СправочникСсылка.Кассы") Тогда
				Новстр.СуммаНал = стр.УтвержденнаяСумма;
			Иначе
				Новстр.СуммаБезнал = стр.УтвержденнаяСумма;
			КонецЕсли;
			Новстр.СтатьяДвиженияДенежныхСредств = стр.Заказ.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств;
		КонецЕсли;
	КонецЦикла;
	ТаблицаЗП.Свернуть("Подразделение,Фонд,СтатьяДвиженияДенежныхСредств", "СуммаНал,СуммаБезнал");	
	
	// начисления
	ТаблицаСвободныхСредств = ТаблицаЗП.Скопировать();
	ТаблицаСвободныхСредств.Очистить();
	
	Для каждого стр из СсылкаНаОбъект.СвободныеСредства Цикл
		Новстр = ТаблицаСвободныхСредств.Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, стр);
		Новстр.Фонд = стр.БанковскийСчетКасса.Фонд;
		Новстр.Подразделение = стр.БанковскийСчетКасса.Подразделение;
	КонецЦикла;
	
	// политика 
	ВремТЗ = СсылкаНаОбъект.ПолитикаРаспределения.Выгрузить();
	Для каждого стр из СсылкаНаОбъект.ПолитикаРаспределенияПервичная Цикл
		Новстр = ВремТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, стр);
	КонецЦикла;
		
	Запрос.УстановитьПараметр("Организация", СсылкаНаОбъект.Организация);
	Запрос.УстановитьПараметр("ТекДок", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ФП_Заказы", ТаблицаЗП);
	Запрос.УстановитьПараметр("ФП_СвободныеСредства", ТаблицаСвободныхСредств);
	Запрос.УстановитьПараметр("ФондНераспред", Справочники.ИА_Фонды.НераспределенныеСредства);
	Запрос.УстановитьПараметр("ПустойФонд", Справочники.ИА_Фонды.ПустаяСсылка());
    Запрос.УстановитьПараметр("ПолитикаРаспределения", ВремТЗ);
	Запрос.УстановитьПараметр("ПрямыеРасходы", СсылкаНаОбъект.ПрямыеРасходы.Выгрузить());
	Запрос.УстановитьПараметр("РаспределениеПоФондам", СсылкаНаОбъект.РаспределениеПоФондам.Выгрузить());
	Запрос.УстановитьПараметр("НаДату", СсылкаНаОбъект.Дата);
	Запрос.УстановитьПараметр("ПустаяСтатья", Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка());
	Запрос.УстановитьПараметр("ДоходыБП", СсылкаНаОбъект.ДоходыБП.Выгрузить());
	Запрос.УстановитьПараметр("ДоходыБП_Распределение", СсылкаНаОбъект.ДоходыБП_Распределение.Выгрузить());
	Запрос.УстановитьПараметр("ФондБП", Константы.ИА_ФП_ФондДоходовБП.Получить());
	Запрос.УстановитьПараметр("ПодразделениеБП", Константы.ИА_ФП_ПодразделениеДоходовБП.Получить());
	
	СворачиватьНалБезнал = Константы.ИА_ФП_РазделятьНалИБезнал.Получить();
	
	Если СворачиватьНалБезнал Тогда
		Макет = ПолучитьМакет("СостояниеФондовСвернуто");
	Иначе
		Макет = ПолучитьМакет("СостояниеФондов");
	КонецЕсли;
	                                                                           
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	ОблШапка.Параметры.Номер = Число(Прав(СсылкаНаОбъект.Номер,5));
	ОблШапка.Параметры.ДатаНачала = Формат(СсылкаНаОбъект.Дата+ 60*60*24, "ДФ='dd MMMM yyyy ""г.""'");
	ОблШапка.Параметры.ДатаКонца = Формат(СсылкаНаОбъект.Дата + 60*60*24*7 , "ДФ='dd MMMM yyyy ""г.""'");
	ОблШапка.Параметры.СуммаКРаспределению = СсылкаНаОбъект.СуммаКРаспределениюСОстаткомНал + СсылкаНаОбъект.СуммаКРаспределениюСОстаткомБезнал;
	ОблШапка.Параметры.Организация = ВРЕГ(СсылкаНаОбъект.Организация);
	ТабДокумент.Вывести(ОблШапка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ВыводитьИтог =Ложь;
	Пока Выборка.Следующий() Цикл
		Если Выборка.ТипЗаписи() = ТипЗаписиЗапроса.ДетальнаяЗапись Тогда
			Продолжить;
		КонецЕсли;
		
		ВыводитьИтог = Истина;
		Если Выборка.ТипЗаписи() = ТипЗаписиЗапроса.ОбщийИтог Тогда
			ОблСтрокаИтог = Макет.ПолучитьОбласть("СтрокаИтог");
			ОблСтрокаИтог.Параметры.Заполнить(Выборка);
            ОблСтрокаИтог.Параметры.Фонд = "Итог";
			Продолжить;
		КонецЕсли;
		
		Если Выборка.СтатьяДвиженияДенежныхСредств = null И Выборка.Фонд = null Тогда
			ОблСтрока = Макет.ПолучитьОбласть("СтрокаПодразделение");
			ОблСтрока.Параметры.Заполнить(Выборка);
			ОблСтрока.Параметры.Фонд = Выборка.Подразделение;
		ИначеЕсли Выборка.Фонд <> null И Выборка.СтатьяДвиженияДенежныхСредств = null Тогда
			ОблСтрока = Макет.ПолучитьОбласть("СтрокаФонд");
			ОблСтрока.Параметры.Заполнить(Выборка);
			ОблСтрока.Параметры.Фонд = "  " + Выборка.Фонд;
		ИначеЕсли Выборка.СтатьяДвиженияДенежныхСредств <> null Тогда
			ОблСтрока = Макет.ПолучитьОбласть("Строка");
			ОблСтрока.Параметры.Заполнить(Выборка);
			ОблСтрока.Параметры.Фонд = "    " + Выборка.СтатьяДвиженияДенежныхСредств;								
		КонецЕсли;
		
		ТабДокумент.Вывести(ОблСтрока);
	КонецЦикла;
	Если ВыводитьИтог Тогда
		ТабДокумент.Вывести(ОблСтрокаИтог);
	КонецЕсли;
	
	//ОблПодвал = Макет.ПолучитьОбласть("Подвал");
	//ТабДокумент.Вывести(ОблПодвал);
	
	ТабДокумент.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
	ТабДокумент.АвтоМасштаб=Истина;
	
	Возврат ТабДокумент;
	
КонецФункции
